app/Controllers/Admin.php

    public function akomodasi()
    {
        $data = [
            'user' => [
                'nama' => $this->session->get('nama'),
                'role' => $this->session->get('role')
            ],
            'akomodasi' => $this->akomodasiModel->findAll()
---
SELECT *
FROM `akomodasi`

    public function tipeKamarForm($id = null)
    {
        $tipeKamar = $id ? $this->tipeKamarModel->find($id) : null;

        $data = [
            'user' => [
                'nama' => $this->session->get('nama'),
                'role' => $this->session->get('role')
            ],
            'tipe_kamar' => $tipeKamar,
            'akomodasi' => $this->akomodasiModel->findAll()
---
SELECT *
FROM `tipe_kamar`
WHERE `tipe_kamar`.`id` = '4'
SELECT *
FROM `akomodasi`

    public function users()
    {
        $data = [
            'user' => [
                'nama' => $this->session->get('nama'),
                'role' => $this->session->get('role')
            ],
            'users' => $this->userModel->findAll()
---
SELECT *
FROM `users`