app/Controllers/Home.php

   public function index()
        {
            $tipe = $this->request->getGet('tipe');
            $keyword = $this->request->getGet('search');

            $builder = $this->akomodasiModel;

            // filter tipe
            if ($tipe && $tipe !== 'semua') {
                $builder->where('tipe', $tipe);
            }

            // filter keyword
            if ($keyword) {
                $akomodasi = $this->akomodasiModel->searchAkomodasi($keyword);
            } else {
                $akomodasi = $builder->findAll();
---
SELECT *
FROM `akomodasi`

    public function detail($id)
    {
        $akomodasi = $this->akomodasiModel->getDetailAkomodasi($id);

        if (!$akomodasi) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound();
        }

        $data = [
            'akomodasi' => $akomodasi,
            'foto' => $this->fotoModel->where('akomodasi_id', $id)->orderBy('urutan')->findAll(),
            'fasilitas' => (new \App\Models\FasilitasModel())->where('akomodasi_id', $id)->findAll(),
            'highlights' => (new \App\Models\HighlightModel())->where('akomodasi_id', $id)->findAll(),
            'kebijakan' => (new \App\Models\KebijakanModel())->where('akomodasi_id', $id)->first(),
            'tipe_kamar' => (new \App\Models\TipeKamarModel())->where('akomodasi_id', $id)->findAll()
---
SELECT *
FROM `fasilitas`
WHERE `akomodasi_id` = '1'
SELECT *
FROM `highlights`
WHERE `akomodasi_id` = '1'
SELECT *
FROM `kebijakan`
WHERE `akomodasi_id` = '1'
 LIMIT 1
SELECT *
FROM `tipe_kamar`
WHERE `akomodasi_id` = '1'