app/Controllers/PemesananController.php

SELECT *
FROM `tipe_kamar`
WHERE `tipe_kamar`.`id` = '4'
SELECT *
FROM `akomodasi`
WHERE `akomodasi`.`id` = '1'
---
    public function form($tipeKamarId)
    {
        if (!$this->session->get('logged_in')) {
            return redirect()->to('auth/login');
        }

        $tipeKamar = $this->tipeKamarModel->find($tipeKamarId);

        if (!$tipeKamar) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound();
        }

        $akomodasi = $this->akomodasiModel->find($tipeKamar['akomodasi_id']);

SELECT *
FROM `tipe_kamar`
WHERE `tipe_kamar`.`id` = '4'
SELECT *
FROM `akomodasi`
WHERE `akomodasi`.`id` = '1'
---
            }
        }

        $tipeKamar = $this->tipeKamarModel->find($this->request->getPost('tipe_kamar_id'));
        $akomodasi = $this->akomodasiModel->find($tipeKamar['akomodasi_id']);

INSERT INTO `pemesanan` (`user_id`, `akomodasi_id`, `tipe_kamar_id`, `tanggal_checkin`, `tanggal_checkout`, `jumlah_malam`, `biaya_admin_ppn`, `total_harga`, `metode_pembayaran`, `bukti_pembayaran`, `status`, `catatan`, `created_at`, `updated_at`) VALUES ('9', '1', '4', '2026-01-14', '2026-01-21', 7, 1309000, 7259000, 'cash', NULL, 'pending', 'cpt', '2026-01-14 08:13:41', '2026-01-14 08:13:41')
---
            'catatan' => $this->request->getPost('catatan')
        ];

        $pemesananId = $this->pemesananModel->insert($data);