app/Controllers/Staff.php

SELECT COUNT(*) AS `numrows`
FROM `pemesanan`
WHERE DATE(tanggal_checkin) = '2026-01-15'
AND `status` = 'checked-in'
SELECT COUNT(*) AS `numrows`
FROM `pemesanan`
WHERE `status` = 'checked-in'
SELECT COUNT(*) AS `numrows`
FROM `pemesanan`
WHERE `status` = 'pending'
---
    public function dashboard()
    {
        // Statistik harian
        $today = date('Y-m-d');

        $data = [
            'user' => [
                'nama' => $this->session->get('nama'),
                'role' => $this->session->get('role')
            ],
            'pemesanan' => $this->pemesananModel->getAllPemesananWithDetails(),
            'stats' => [
                'pemesanan_hari_ini' => $this->pemesananModel->where('DATE(created_at)', $today)->countAllResults(),
                'checkin_hari_ini' => $this->pemesananModel->where('tanggal_checkin', $today)->where('status', 'checked-in')->countAllResults(),
                'kamar_terpakai' => $this->pemesananModel->where('status', 'checked-in')->countAllResults(),
                'pending' => $this->pemesananModel->where('status', 'pending')->countAllResults()

SELECT *
FROM `users`
WHERE `users`.`id` = '9'
SELECT `pemesanan_status_log`.*, `users`.`nama` as `changed_by_name`
FROM `pemesanan_status_log`
LEFT JOIN `users` ON `users`.`id` = `pemesanan_status_log`.`changed_by`
WHERE `pemesanan_id` = '10'
ORDER BY `created_at` DESC
SELECT *
FROM `pemesanan`
WHERE `pemesanan`.`id` = '11'
---
    public function detailPemesanan($id)
    {
        $allPemesanan = $this->pemesananModel->getAllPemesananWithDetails();

        $pemesanan = null;
        foreach ($allPemesanan as $p) {
            if ($p['id'] == $id) {
                $pemesanan = $p;
                break;
            }
        }

        if (!$pemesanan) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound();
        }

        $tamu = $this->userModel->find($pemesanan['user_id']);

        $db = \Config\Database::connect();
        $statusLog = $db->table('pemesanan_status_log')
                        ->select('pemesanan_status_log.*, users.nama as changed_by_name')
                        ->join('users', 'users.id = pemesanan_status_log.changed_by', 'left')
                        ->where('pemesanan_id', $id)
                        ->orderBy('created_at', 'DESC')
                        ->get()
                        ->getResultArray();

        $data = [
            'user' => [
                'nama' => $this->session->get('nama'),
                'role' => $this->session->get('role')
            ],
            'pemesanan' => $pemesanan,
            'tamu' => $tamu,
            'status_log' => $statusLog
        ];

UPDATE `pemesanan` SET `status` = 'checked-in', `check_in` = '2026-01-15 08:21:56', `updated_at` = '2026-01-15 08:21:56'
WHERE `pemesanan`.`id` IN ('11')
INSERT INTO `pemesanan_status_log` (`pemesanan_id`, `status_lama`, `status_baru`, `changed_by`, `keterangan`) VALUES ('11', '', 'checked-in', '8', 'bismillahhhhh')
---
    public function updateStatus()
    {
        $pemesananId = $this->request->getPost('pemesanan_id');
        $statusBaru = $this->request->getPost('status');
        $keterangan = $this->request->getPost('keterangan');

        // Get pemesanan lama
        $pemesanan = $this->pemesananModel->find($pemesananId);
        if (!$pemesanan) {
            return redirect()->back()->with('error', 'Pemesanan tidak ditemukan');
        }

        $statusLama = $pemesanan['status'];

        // Update status
        $this->pemesananModel->update($pemesananId, ['status' => $statusBaru]);

        // Log perubahan status
        $db = \Config\Database::connect();
        $db->table('pemesanan_status_log')->insert([
            'pemesanan_id' => $pemesananId,
            'status_lama' => $statusLama,
            'status_baru' => $statusBaru,
            'changed_by' => $this->session->get('user_id'),
            'keterangan' => $keterangan
        ]);

SELECT *
FROM `users`
WHERE `users`.`id` = '7'
---
    private function sendConfirmationEmail($pemesananId)
    {
        $pemesanan = $this->pemesananModel->getDetailPemesananFull($pemesananId);
        $tamu = $this->userModel->find($pemesanan['user_id']);

SELECT `tipe_kamar`.*, `akomodasi`.`nama` as `nama_akomodasi`
FROM `tipe_kamar`
JOIN `akomodasi` ON `akomodasi`.`id` = `tipe_kamar`.`akomodasi_id`
---
    public function kelolaKamar()
    {
        $keyword = $this->request->getGet('search');

        $builder = $this->tipeKamarModel;

        if ($keyword) {
            $builder = $builder->like('nama_tipe', $keyword);
        }

        $tipeKamar = $builder->select('tipe_kamar.*, akomodasi.nama as nama_akomodasi')
                             ->join('akomodasi', 'akomodasi.id = tipe_kamar.akomodasi_id')
                             ->findAll();

SELECT *
FROM `users`
WHERE `role` = 'pelanggan'
SELECT COUNT(*) AS `numrows`
FROM `pemesanan`
WHERE `user_id` = '5'
---
    public function dataTamu()
    {
        $keyword = $this->request->getGet('search');

        $builder = $this->userModel;

        if ($keyword) {
            $builder = $builder->like('nama', $keyword)
                               ->orLike('email', $keyword)
                               ->orLike('no_telp', $keyword);
        }

        $tamu = $builder->where('role', 'pelanggan')->findAll();

        // Get pemesanan count for each tamu
        foreach ($tamu as &$t) {
            $t['total_pemesanan'] = $this->pemesananModel->where('user_id', $t['id'])->countAllResults();