app/Controllers/User.php

    public function profil()
    {
        if (!$this->session->get('logged_in')) {
            return redirect()->to('auth/login');
        }

        $userId = $this->session->get('user_id');
        $user = $this->userModel->find($userId);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '5'