app/Models/AkomodasiModel.php

SELECT *
FROM `akomodasi`
WHERE `akomodasi`.`id` = '1'
---
    public function getDetailAkomodasi($id)
    {
        return $this->find($id);